7767517
161 177
Input            input                    0 1 input
MemoryData       301                      0 1 301 0=1 1=48 2=48
Padding          Pad_0                    1 1 input 149 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00 7=0 8=0
Convolution      Conv_1                   1 1 149 150 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=864
Clip             Clip_2                   1 1 150 151 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_3                   1 1 151 152 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_4                   1 1 152 153 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_5                   1 1 153 154 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_6                   1 1 154 155 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             Clip_7                   1 1 155 156 0=0.000000e+00 1=6.000000e+00
Padding          Pad_8                    1 1 156 157 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_9                   1 1 157 158 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=864 7=96
Clip             Clip_10                  1 1 158 159 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_11                  1 1 159 160 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 160 160_splitncnn_0 160_splitncnn_1
Convolution      Conv_12                  1 1 160_splitncnn_1 161 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_13                  1 1 161 162 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_14                  1 1 162 163 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_15                  1 1 163 164 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_16                  1 1 164 165 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_17                   2 1 160_splitncnn_0 165 166 0=0
Split            splitncnn_1              1 2 166 166_splitncnn_0 166_splitncnn_1
Convolution      Conv_18                  1 1 166_splitncnn_1 167 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_19                  1 1 167 168 0=0.000000e+00 1=6.000000e+00
Padding          Pad_20                   1 1 168 169 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_21                  1 1 169 170 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=1296 7=144
Clip             Clip_22                  1 1 170 171 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_23                  1 1 171 172 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_2              1 2 172 172_splitncnn_0 172_splitncnn_1
Convolution      Conv_24                  1 1 172_splitncnn_1 173 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_25                  1 1 173 174 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_26                  1 1 174 175 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_27                  1 1 175 176 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_28                  1 1 176 177 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_29                   2 1 172_splitncnn_0 177 178 0=0
Split            splitncnn_3              1 2 178 178_splitncnn_0 178_splitncnn_1
Convolution      Conv_30                  1 1 178_splitncnn_1 179 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_31                  1 1 179 180 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_32                  1 1 180 181 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_33                  1 1 181 182 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_34                  1 1 182 183 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_35                   2 1 178_splitncnn_0 183 184 0=0
Split            splitncnn_4              1 2 184 184_splitncnn_0 184_splitncnn_1
Convolution      Conv_36                  1 1 184_splitncnn_1 185 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_37                  1 1 185 186 0=0.000000e+00 1=6.000000e+00
Padding          Pad_38                   1 1 186 187 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_39                  1 1 187 188 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=1728 7=192
Clip             Clip_40                  1 1 188 189 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_41                  1 1 189 190 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_5              1 2 190 190_splitncnn_0 190_splitncnn_1
Convolution      Conv_42                  1 1 190_splitncnn_1 191 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_43                  1 1 191 192 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_44                  1 1 192 193 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_45                  1 1 193 194 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_46                  1 1 194 195 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_47                   2 1 190_splitncnn_0 195 196 0=0
Split            splitncnn_6              1 2 196 196_splitncnn_0 196_splitncnn_1
Convolution      Conv_48                  1 1 196_splitncnn_1 197 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_49                  1 1 197 198 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_50                  1 1 198 199 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_51                  1 1 199 200 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_52                  1 1 200 201 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_53                   2 1 196_splitncnn_0 201 202 0=0
Split            splitncnn_7              1 2 202 202_splitncnn_0 202_splitncnn_1
Convolution      Conv_54                  1 1 202_splitncnn_1 203 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_55                  1 1 203 204 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_56                  1 1 204 205 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_57                  1 1 205 206 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_58                  1 1 206 207 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_59                   2 1 202_splitncnn_0 207 208 0=0
Split            splitncnn_8              1 2 208 208_splitncnn_0 208_splitncnn_1
Convolution      Conv_60                  1 1 208_splitncnn_1 209 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_61                  1 1 209 210 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_62                  1 1 210 211 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_63                  1 1 211 212 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_64                  1 1 212 213 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_9              1 2 213 213_splitncnn_0 213_splitncnn_1
Convolution      Conv_65                  1 1 213_splitncnn_1 214 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_66                  1 1 214 215 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_67                  1 1 215 216 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_68                  1 1 216 217 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_69                  1 1 217 218 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_70                   2 1 213_splitncnn_0 218 219 0=0
Split            splitncnn_10             1 2 219 219_splitncnn_0 219_splitncnn_1
Convolution      Conv_71                  1 1 219_splitncnn_1 220 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_72                  1 1 220 221 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_73                  1 1 221 222 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_74                  1 1 222 223 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_75                  1 1 223 224 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_76                   2 1 219_splitncnn_0 224 225 0=0
Convolution      Conv_77                  1 1 225 226 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_78                  1 1 226 227 0=0.000000e+00 1=6.000000e+00
Padding          Pad_79                   1 1 227 228 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_80                  1 1 228 229 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=5184 7=576
Clip             Clip_81                  1 1 229 230 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_82                  1 1 230 231 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_11             1 2 231 231_splitncnn_0 231_splitncnn_1
Convolution      Conv_83                  1 1 231_splitncnn_1 232 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_84                  1 1 232 233 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_85                  1 1 233 234 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_86                  1 1 234 235 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_87                  1 1 235 236 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_88                   2 1 231_splitncnn_0 236 237 0=0
Split            splitncnn_12             1 2 237 237_splitncnn_0 237_splitncnn_1
Convolution      Conv_89                  1 1 237_splitncnn_1 238 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_90                  1 1 238 239 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_91                  1 1 239 240 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_92                  1 1 240 241 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_93                  1 1 241 242 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_94                   2 1 237_splitncnn_0 242 243 0=0
Convolution      Conv_95                  1 1 243 244 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_96                  1 1 244 245 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_97                  1 1 245 246 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_98                  1 1 246 247 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_99                  1 1 247 248 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Convolution      Conv_100                 1 1 248 249 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=409600
Clip             Clip_101                 1 1 249 250 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_102                 1 1 250 251 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=81920
Convolution      Conv_103                 1 1 208_splitncnn_0 252 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Interp           Upsample_104             1 1 251 256 0=2 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp         Add_105                  2 1 252 256 257 0=0
ConvolutionDepthWise Conv_106                 1 1 257 258 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      Conv_107                 1 1 258 259 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             Relu_108                 1 1 259 260
Convolution      Conv_109                 1 1 184_splitncnn_0 261 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Interp           Upsample_110             1 1 260 265 0=2 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp         Add_111                  2 1 261 265 266 0=0
ConvolutionDepthWise Conv_112                 1 1 266 267 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      Conv_113                 1 1 267 268 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
ReLU             Relu_114                 1 1 268 269
Convolution      Conv_115                 1 1 166_splitncnn_0 270 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
Interp           Upsample_116             1 1 269 274 0=2 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp         Add_117                  2 1 270 274 275 0=0
ConvolutionDepthWise Conv_118                 1 1 275 276 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_119                 1 1 276 277 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_120                 1 1 277 278
Split            splitncnn_13             1 4 278 278_splitncnn_0 278_splitncnn_1 278_splitncnn_2 278_splitncnn_3
ConvolutionDepthWise Conv_121                 1 1 278_splitncnn_3 279 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_122                 1 1 279 280 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_123                 1 1 280 281
Convolution      Conv_124                 1 1 281 282 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=96
ConvolutionDepthWise Conv_125                 1 1 278_splitncnn_2 283 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_126                 1 1 283 284 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_127                 1 1 284 285
Convolution      Conv_128                 1 1 285 286 0=34 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3264
ConvolutionDepthWise Conv_129                 1 1 278_splitncnn_1 287 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_130                 1 1 287 288 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_131                 1 1 288 289
Convolution      Conv_132                 1 1 289 290 0=17 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1632
ConvolutionDepthWise Conv_133                 1 1 278_splitncnn_0 291 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_134                 1 1 291 292 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_135                 1 1 292 293
Convolution      Conv_136                 1 1 293 294 0=34 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3264
Permute          Transpose_137            1 1 286 regress 0=3
Permute          Transpose_138            1 1 294 offset 0=3
Sigmoid          Sigmoid_139              1 1 290 297
Permute          Transpose_140            1 1 297 heatmap 0=3
Sigmoid          Sigmoid_141              1 1 282 299
Permute          Transpose_142            1 1 299 300 0=3
BinaryOp         Mul_144                  2 1 300 301 302 0=2
Reshape          Reshape_146              1 1 302 center 0=1 1=2304
